// 1) შექმენით ფორმა, შემდგარი მინიმუმ სამი input-ის. მომხმარებელს შემოატანინეთ სრული სახელი, ემაილი და პაროლი. შემოტანილი მონაცემები გამოიტანეთ საიტზე.

// მაგალითი:
// <h1>User Data</h1>
// <p>Fullname: #{fullname}</p>
// ...

// 2) შექმენით სარეგისტრაციო ფორმა. რეგისტრაციის შემდეგ მომხმარებლის მონაცემი უნდა შეინახოთ სიაში ობიექტის სახით. თითოეულ მომხმარებელს უნდა ჰქონდეს თავისი ობიექტი. ამ ობიექტებს კარგი იქნება თუ შექმნით ობიექტის კონსტრუქტორი ფუნქციის მეშვეობით. გააკეთეთ შემოწმება, რომ მომხმარებელი უკვე დაკავებული ემაილით ვერ დარეგისტრირდეს. 

// რეგისტრაციის ფორმის ქვემოთ შექმენით ავტორიზაციის ფორმა, რომლის დადასტურების შემთხვევაში მოხდება შემოწმება შემოტანილი მონაცემებით თუ არსებობს ექაუნთი და ავტორიზაციის წარმატებით/წარუმატებლად დასრულების შემთხვევაში გამოიტანეთ შესაბამისი alert მესიჯი.

// დაუმატეთ ამ საიტს დიზაინი.


const form =document.getElementById('form');
        const div =document.getElementById('div');
        form.addEventListener('submit', (e) => {
            e.preventDefault();

            const input1 = document.getElementById('input1').value;
            const input2 = document.getElementById('input2').value;
            const input3 = document.getElementById('input3').value;

            div.innerHTML = `
            <p>ful name: ${input1}</p>
            <p>email: ${input2}</p>
            <p>password: ${input3}</p>`
            ;
        })