// 2) შექმენით 5 ელემენტიანი მასივი და მისი თითეული ელემენტი შეინახეთ ცვლადში, დესტრუქციის მეშვეობით

// 3) შექმენით ობიექტი მინიმუმ სამი კუთვნილებით და მისი თითეული კუთვნილება შეინახეთ ცვლადში, დესტრუქციის მეშვეობით

// 4) კომენტარებით ახსენით რა არის rest/spread ოპერატორები და რა განსხვავებაა მათ შორის.

// 5) შექმენით ფუნქცია, რომელსაც გადაეცემა n რაოდენობის რიცხვი, ამ ფუნქციამ უნდა დააბრუნოს გადაცემული რიცხვების ჯამი. გამოიძახეთ ის რამოდენიმეჯერ და ყოველ ჯერზე არგუმენტად გადაეცით სხვადასხვა რაოდენობის რიცხვი.

// 6) შექმენით 10 ელემენტიანი მასივი და დააკოპირეთ იგი spread ოპერატორის გამოყენებით.

// 7) შექმენით ობიექტი მინიმუმ ხუთი კუთვნილებით. თქვენი დავალებაა დესტურქციის გამოყენებით პირველი ორი კუთვნილება შეინახოთ ცვლადებში, ხოლო დანარჩენი კუთვნილებები ახალი ობიექტის სახით(დაგჭირდებათ spread ოპერატორი)