// 2) შექმენით while loop'ი რომელიც გამოიტანს კენტ რიცხვებს 1'დან 200'მდე
let i = 1;
while (i <= 200) {
    console.log(i);
    i += 2;
}
// 3) შექმენით while loop'ი რომელიც გამოიტანს 3'ის ჯერად რიცხვებს 51'დან 150'მდე
let x = 51; 
while (x <= 150) {
    console.log(x);
    x += 3;
}
// 4) შექმენით for loop'ი რომელიც გამოიტანს ყველა რიცხვს 0'დან 100'მდე
for (let a = 0; a <= 100; a++) {
    console.log(a);
}
// 5) შექმენით for loop'ი რომელიც გამოიტანს ყოველ მეორე რიცხვს 100'დან 300'მდე
for (let y = 100; y <= 300; y += 2) {
    console.log(y);
}