// 2) მოიძიეთ ინფორმაცია Document Object Model'ზე და ახსენით რა არის
// Document Object Model(DOM) არის წერტილები დაკავშირებული ერთმანეთთან, როგორიცაა ჩანესთვა. შემდეგ ეს არის გამოტანილი საიტის მიერ რომ მომხმარებელმა დაინახოს. როდესაც ცვლილებას ვახდენთ DOM-ში , საიტმა უნდა თავიდან გამოიტანოს ყველაფერი შეცვლილად.
// 3) შექმენით 2 Number ტიპის ცვლადი, დაამატეთ ერთმანეტს და გამოიტანეთ console'ში

let num1 = 10;
let num2 = 25;
console.log(num1 + num2)
// 4) ახსენით რა არის console
// console არის tool რომელსაც შეუძლია გამოთვლები გააკეთოს, გამოიტანოს log-ები. ის გავს პითონის ტერმინალს.
// 5) ახსენით რას აკეთებს let keyword
// let არის ცვლადის ტიპი რომლის გამოყენება შეგვიძლია რომელ ბლოკშიც არის ჩასმული მხოლოდ მანდ({let x = 10}) ასევე მას ახასიათებს თან მიყოლით გაშვება. მაგალითად სანამ num1-ს არ ვუზავდი დეკლარაციას, მანამდე არ გამოიტანდა var-ისგან განსხვავებით
// 6) უყურეთ ამ ვიდეოს 2:24'მდე
// https://www.youtube.com/watch?v=jwRAdGLUarw
// Done