#1)პირველი ვერ გავიგე



#2)https://www.youtube.com/watch?v=x7X9w_GIm1s
#პითონი არის მსოფლიში ყველაზე პოპულარული პროგრამირების ენა რადგან ის არის მარტივი სასწავლად და პრაქტიკული სერიოზული პროექტისთებისთვის ის ხშირად არის გამოყენებული web app-ებისთვის.ის არის მარტივი წასაკითხი.

#3)https://www.youtube.com/watch?v=OxGsU8oIWjY
#წარმოიდგინე რომ არის ჰოტელი უსასრულო ოთახებით რომლებიც მიდის ნომრებით როგორიცაა 1,2,3,4,5,6,7,... , და შენ ხარ მენეჯერი.ვიღაც შემოდის მაგრამ ყველა ოთახი არის დაკავებული, მოგიწევს რომ გადაალაგო ხალხი თავისის ოთახიდან გაორმაგებულ ნომერზე: პირველი მეორეშ, მეორე მეოთხეშ, მესამე მეექვსეში და ა.შ . ბოლოს ერთი წვეულების უსასრულოდ გრძელი და უსასრულო რაოდენობის ხალხით ავტობუსი  ავტობუსი მოვა რომელსაც სკამები არ აქვს და ყველა ხალხს ავტობუსსზე აქვს განსხავევბული სახელი ერთმანეთისგან მათი სახელი შედგება ორი ასოსგან (A,B) მაგრამ თითოეული სახელი არის უსასრულოდ გრძელი, მაგრამ შენ ეტყვი მათ რომ შანსი არაა რომ ყველანი დაეტივნენ მანდ.ერთერთი მათგანი მოვა და გეტყვის რომ შენ გაქვს უსასსრულო რაოდენობის ოთახები და შეგეკითხება: :"რატომ ვერ გამოვა ?" ხოდა შენ ანახებ თ რატომ ვერ გამოვა, ამოიღებ შენს უსასრულო ფურცელს და დაიწყებ დალაგებას ხალხის თავიანთ ნომრებთან.მაგრამ შემდეგ იტყვი რომ კდიევ შეგიძლია ჩამოწერა ხალხის და გააკეთებ ცალკე ცხრილს რომელშიც დაწერ იმ ხალხს  რომლებისთვისაც ნომრები არ მიგიჩენია .




