// New keywordის გამოყენებით 
// შექმენით ლისთი რომელშიც შეინახავთ 5 სხვადასხვა ელემენტს, შემდეგ ინდექსინგის გამოყენებით გამოიტანეთ კონსოლში ყველა ეს ელემენტი

let arr = new Array(5, 25, 10, 30, 20)
console.log(arr[0])
console.log(arr[1])
console.log(arr[2])
console.log(arr[3])
console.log(arr[4])

// შექმენით ლისთი New Keywordოს გამოყენებით რომელსაც არგუმენტად მისცემთ 4ს, კომენტარების დახმარებით ახსენით რას ნიშნავს ეს 4

let arr1 = new Array(4)

// როდესაც New keyword'ს ვაძლევთ 4'ს არგუმენტად იგი ქმნის Array'ს რომელსაც აქვს Length 4 და არა რიცხვი 4

// შექმენით ლისთი New keywordის გამოყენების გარეშე და შეინახეთ 3 ელემენტი

let arr2 = Array(5, 10, 15)


// შექმენით ცარიელი Array, რომელსაც დაამატებთ თქვენს სახელს, გვარს და ასაკს. დაამსგავსეთ ის Associative Arrayს, შემდეგ კი ახსენით, რატომ აჩვენებს Array ზომა 0ს

let WebCourse = []
WebCourse['Name'] = 'Erekle'
WebCourse['Surname'] = 'Napireli'
Webcourse['Age'] = 14

// Array'ს ზომა 0-ს იმიტომ აჩვენებს, რომ Object'ები შეგვყავს და არა რიცხვითი ინდექსები