# 2) შექმენით დაულაგებელი list'ი რომელსაც ექნება 10 ელემენტი (თითოეული ელემენტი ეცადეთ რომ სხვადასხვა იყოს, მაგალითად ზოგში img ჩასვით, ზოგში a და ა.შ)
my_list = [
    42,
    3.14,
    "Hello",
    True,
    None,
    [1, 2, 3],
    {"name": "Alice", "age": 25},
    (1, 2),
    "apple",
    99
]

print(my_list)


# 3) შექმენით დალაგებული list'ი რომელსაც ექნება 10 ელემენტი (თითოეული ელემენტი ეცადეთ რომ სხვადასხვა იყოს, მაგალითად ზოგში img ჩასვით, ზოგში a და ა.შ)
listnn = [
    3.14,
    42,
    "apple",
    "Hello",
    True,
    None,
    [1, 2, 3],
    {"name": "Alice", "age": 25},
    (1, 2),
    "<a href='https://example.com'>Link</a>"
]

print(listnn)


# 4) ჩანესტეთ დაულაგებელი list'ი დალაგებულში (არ დაგავიწყდეთ რომ სხვა li'ებიც მისცეთ parent ელემენტს)
# 5) ჩანესტეთ დალაგებული list'ი დაულაგებელში (არ დაგავიწყდეთ რომ სხვა li'ებიც მისცეთ parent ელემენტს)
# 6) თქვენი სიტყვებით ახსენით რა არის ატრიბუტი, რა არის optional ატრიბუტი, რა არის required ატრიბუტი და მოიყვანეთ მაგალითები